x/data/types.go
// [[file:~/regen-ledger/x/data/README.org::*Transaction%20Messages%20and%20Types][Transaction Messages and Types:1]]
// DO NOT EDIT THIS FILE
  package data
// Transaction Messages and Types:1 ends here

// [[file:~/regen-ledger/x/data/README.org::*Transaction%20Messages%20and%20Types][Transaction Messages and Types:2]]
type DataFormat int

const (
  Unknown DataFormat = 0
  NQuads DataFormat  = 1
  JSON_LD DataFormat = 2
  JSON DataFormat    = 3
  Turtle DataFormat  = 4
  TRIG DataFormat    = 5
)

type HashAlgorithm int

const (
  BLAKE2B_256 HashAlgorithm = 0
  SHA256 HashAlgorithm = 1
  URDNA2015 HashAlgorithm = 2
  URGNA2012 HashAlgorithm = 3
)

type MsgStoreData struct {
  Data []byte `json:"data"`
  Format DataFormat `json:"format,omitempty"`
}

type MsgStoreGraph struct {
  NQuads string `json:"nquads"`
  URDNA2015Hash []byte `json:"urdna2015_hash"`
	Signers []sdk.AccAddress `json:"signers"`
}

type MsgTrackData struct {
  Hash []byte `json:"hash"`
  Algorithm HashAlgorithm `json:"algorithm"`
  Format DataFormat `json:"format,omitempty"`
  Url string `json:"url,omitempty"`
}
// Transaction Messages and Types:2 ends here
